In [40]:
from tokenize import group

# To read csv file
import pandas as pd

# read data from CSV file into dataframe
df=pd.read_csv("C:\\Users\\manoj\\PyCharmMiscProject\\sales_data_sample.csv",encoding="latin1")
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

In [18]:
# To Read Excel File
import pandas as pd
df=pd.read_excel("D:\\Documents\\Computer Course\\phyton\\sample_data.xlsx")
print(df)

   ID     Name  Age     City  Salary
0   1    Alice   25    Delhi   50000
1   2      Bob   30   Mumbai   60000
2   3  Charlie   35  Chennai   70000
3   4    David   40  Kolkata   80000

In [19]:
# To Read JSON file
import pandas as pd
dp=pd.read_json("sample_Data.json")
print(dp)

    id                                               name  \
0    1                                    Apple iPhone 12
1    2                                 Samsung Galaxy S21
2    3                                 Sony PlayStation 5
3    4                  LG OLED55CXPUA 55-inch 4K OLED TV
4    5        Bose QuietComfort 35 II Wireless Headphones
5    6                          Fitbit Versa 3 Smartwatch
6    7                             KitchenAid Stand Mixer
7    8                 Dyson V11 Absolute Cordless Vacuum
8    9                         Ninja Foodi Smart XL Grill
9   10                    Canon EOS Rebel T8i DSLR Camera
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description    price  \
0   The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2   The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4   The Bose QuietComfort 35 II Wireless Headphone...   299.00
5   The Fitbit Versa 3 Smartwatch features a built...   229.95
6   The KitchenAid Stand Mixer features a 5-quart ...   399.99
7   The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8   The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9   The Canon EOS Rebel T8i DSLR Camera features a...   899.00
10  The Apple AirPods Pro feature active noise can...   249.00
11  The Bose QuietComfort 35 II Wireless Headphone...   299.00
12  The Fitbit Charge 4 Fitness Tracker features G...   129.95
13  The Samsung Galaxy Watch3 features a rotating ...   399.99
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...   349.99
15  The Breville Barista Express Espresso Machine ...   699.95
16  The Keurig K-Elite Coffee Maker features a str...   169.99
17  The iRobot Roomba i7+ Robot Vacuum features au...   799.99
18  The Ninja Foodi Digital Air Fry Oven features ...   209.99
19  The Cuisinart ICE-70 Ice Cream Maker features ...   139.99

           category                                              image
0       Electronics  https://www.apple.com/newsroom/images/product/...
1       Electronics  https://images.samsung.com/is/image/samsung/p6...
2       Electronics  https://www.sony.com/image/44baa604124b770c824...
3       Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4       Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5       Electronics  https://www.fitbit.com/global/content/dam/fitb...
6    Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7   Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8    Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9       Electronics  https://www.canon.com.au/-/media/images/produc...
10      Electronics  https://www.apple.com/v/airpods-pro/b/images/m...
11      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
12      Electronics  https://www.fitbit.com/global/content/dam/fitb...
13      Electronics  https://images.samsung.com/is/image/samsung/as...
14      Electronics  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15   Home & Kitchen  https://www.breville.com/content/dam/breville/...
16   Home & Kitchen  https://www.keurig.com/content/dam/global-ecom...
17   Home & Kitchen  https://store.irobot.com/default/i7-vacuuming-...
18   Home & Kitchen  https://www.ninjakitchen.com/static/img/produc...
19   Home & Kitchen  https://www.cuisinart.com/share/images/product...

In [6]:
# To Save the file after data manipulation
import pandas as pd

data = {
    "Name": ['Ram', 'Shyam', 'Ghanshyam'],
    "age": [10, 20, 20],
    "city": ['Dehradun', 'Delhi', 'Haldwani']
}
# coverting data into rows and columns
df = pd.DataFrame(data)
print(df)
# coverting to csv file
df.to_csv("output.csv",index=False)
df.to_excel("output.xlsx",index=False)
df.to_json('output.json',index=False)

        Name  age      city
0        Ram   10  Dehradun
1      Shyam   20     Delhi
2  Ghanshyam   20  Haldwani

In [2]:
import pandas as pd

df = pd.read_json("sample_Data.json")
print("Display 10 rows of first")
print(df.head(10))

print("Display 10 rows of last")
print(df.tail(10))

Display 10 rows of first
   id                                         name  \
0   1                              Apple iPhone 12
1   2                           Samsung Galaxy S21
2   3                           Sony PlayStation 5
3   4            LG OLED55CXPUA 55-inch 4K OLED TV
4   5  Bose QuietComfort 35 II Wireless Headphones
5   6                    Fitbit Versa 3 Smartwatch
6   7                       KitchenAid Stand Mixer
7   8           Dyson V11 Absolute Cordless Vacuum
8   9                   Ninja Foodi Smart XL Grill
9  10              Canon EOS Rebel T8i DSLR Camera

                                         description    price  \
0  The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1  The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2  The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3  The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4  The Bose QuietComfort 35 II Wireless Headphone...   299.00
5  The Fitbit Versa 3 Smartwatch features a built...   229.95
6  The KitchenAid Stand Mixer features a 5-quart ...   399.99
7  The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8  The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9  The Canon EOS Rebel T8i DSLR Camera features a...   899.00

          category                                              image
0      Electronics  https://www.apple.com/newsroom/images/product/...
1      Electronics  https://images.samsung.com/is/image/samsung/p6...
2      Electronics  https://www.sony.com/image/44baa604124b770c824...
3      Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5      Electronics  https://www.fitbit.com/global/content/dam/fitb...
6   Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7  Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8   Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9      Electronics  https://www.canon.com.au/-/media/images/produc...
Display 10 rows of last
    id                                               name  \
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
10  The Apple AirPods Pro feature active noise can...  249.00     Electronics
11  The Bose QuietComfort 35 II Wireless Headphone...  299.00     Electronics
12  The Fitbit Charge 4 Fitness Tracker features G...  129.95     Electronics
13  The Samsung Galaxy Watch3 features a rotating ...  399.99     Electronics
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...  349.99     Electronics
15  The Breville Barista Express Espresso Machine ...  699.95  Home & Kitchen
16  The Keurig K-Elite Coffee Maker features a str...  169.99  Home & Kitchen
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
10  https://www.apple.com/v/airpods-pro/b/images/m...
11  https://assets.bose.com/content/dam/Bose_DAM/W...
12  https://www.fitbit.com/global/content/dam/fitb...
13  https://images.samsung.com/is/image/samsung/as...
14  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15  https://www.breville.com/content/dam/breville/...
16  https://www.keurig.com/content/dam/global-ecom...
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...

In [3]:
# info method
import pandas as pd

df = pd.read_json("sample_Data.json")
print("displaying the  info of data set")
print(df.info())

displaying the  info of data set
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB
None

In [11]:
# describe()
import pandas as pd
data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance score":[80,76,69,97,88,65,77,83]
}
df = pd.DataFrame(data)
print("Sample DataFrame")
print(df)
print("descriptive statistics")
print(df.describe())

Sample DataFrame
        Name  age  salary  performance score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
descriptive statistics
             age        salary  performance score
count   8.000000      8.000000           8.000000
mean   32.125000  52875.000000          79.375000
std    12.472112  14807.695876          10.211163
min    12.000000  30000.000000          65.000000
25%    26.750000  43000.000000          74.250000
50%    31.000000  53000.000000          78.500000
75%    41.000000  62500.000000          84.250000
max    50.000000  73000.000000          97.000000

In [22]:
# shape and column
import pandas as pd

data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance score":[80,76,69,97,88,65,77,83]
}

df = pd.DataFrame(data)
print(df)
print(df.shape)
print("Column Names:")
print(df.columns)

        Name  age  salary  performance score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
(8, 4)
Column Names:
Index(['Name', 'age', 'salary', 'performance score'], dtype='object')

In [7]:
# Column and multi column in series
import pandas as pd

data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance score":[80,76,69,97,88,65,77,83]
}
df=pd.DataFrame(data)
print(df)
print("Single columns")
print(df['Name'])
print("Selecting multiple columns")
print(df[['Name', 'salary']])

        Name  age  salary  performance score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
Single columns
0          Ram
1        Shyam
2    Ghanshyam
3        aditi
4       Sachin
5       mayank
6          raj
7        rahul
Name: Name, dtype: object
Selecting multiple columns
        Name  salary
0        Ram   50000
1      Shyam   40000
2  Ghanshyam   30000
3      aditi   60000
4     Sachin   73000
5     mayank   44000
6        raj   56000
7      rahul   70000

In [12]:
# filtering rows
import pandas as pd

data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance_score":[80,76,69,97,88,65,77,83]
}
df=pd.DataFrame(data)
print(df)
print("Salary greater than 50000")
print(df[df['salary']>50000])

# salary greater than salary > 50000 & age >30
print(df[(df['salary']>50000) & (df['age']>30)])

#or condition
print(df[(df['age']>30) | (df['performance_score']>90)])

        Name  age  salary  performance_score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
Salary greater than 50000
     Name  age  salary  performance_score
3   aditi   50   60000                 97
4  Sachin   29   73000                 88
6     raj   44   56000                 77
7   rahul   32   70000                 83
    Name  age  salary  performance_score
3  aditi   50   60000                 97
6    raj   44   56000                 77
7  rahul   32   70000                 83
        Name  age  salary  performance_score
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
6        raj   44   56000                 77
7      rahul   32   70000                 83

In [4]:
# Modifying Data
import pandas as pd

data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance_score":[80,76,69,97,88,65,77,83]
}
df=pd.DataFrame(data)
print(df)
df['Bonus']=df['salary']*0.1
print(df)
df.insert(0,'Employee id',[10,20,30,40,50,60,70,80])
print(df)
df.loc[0,'salary']=55555
print(df)

        Name  age  salary  performance_score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
        Name  age  salary  performance_score   Bonus
0        Ram   20   50000                 80  5000.0
1      Shyam   30   40000                 76  4000.0
2  Ghanshyam   40   30000                 69  3000.0
3      aditi   50   60000                 97  6000.0
4     Sachin   29   73000                 88  7300.0
5     mayank   12   44000                 65  4400.0
6        raj   44   56000                 77  5600.0
7      rahul   32   70000                 83  7000.0
   Employee id       Name  age  salary  performance_score   Bonus
0           10        Ram   20   50000                 80  5000.0
1           20      Shyam   30   40000                 76  4000.0
2           30  Ghanshyam   40   30000                 69  3000.0
3           40      aditi   50   60000                 97  6000.0
4           50     Sachin   29   73000                 88  7300.0
5           60     mayank   12   44000                 65  4400.0
6           70        raj   44   56000                 77  5600.0
7           80      rahul   32   70000                 83  7000.0
   Employee id       Name  age  salary  performance_score   Bonus
0           10        Ram   20   55555                 80  5000.0
1           20      Shyam   30   40000                 76  4000.0
2           30  Ghanshyam   40   30000                 69  3000.0
3           40      aditi   50   60000                 97  6000.0
4           50     Sachin   29   73000                 88  7300.0
5           60     mayank   12   44000                 65  4400.0
6           70        raj   44   56000                 77  5600.0
7           80      rahul   32   70000                 83  7000.0

In [10]:
import pandas as pd

data={
    "Name": ['Ram', 'Shyam', 'Ghanshyam','aditi','Sachin','mayank','raj','rahul'],
    "age":[20,30,40,50,29,12,44,32],
    "salary":[50000,40000,30000,60000,73000,44000,56000,70000],
    "performance_score":[80,76,69,97,88,65,77,83]
}
df=pd.DataFrame(data)
print(df)
df['salary']=df['salary']*5
print(df)
# removing column and rows in table
df.drop(columns=['salary','age'],inplace=True)
print("updated  data")
print(df)

        Name  age  salary  performance_score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83
        Name  age  salary  performance_score
0        Ram   20  250000                 80
1      Shyam   30  200000                 76
2  Ghanshyam   40  150000                 69
3      aditi   50  300000                 97
4     Sachin   29  365000                 88
5     mayank   12  220000                 65
6        raj   44  280000                 77
7      rahul   32  350000                 83
updated  data
        Name  performance_score
0        Ram                 80
1      Shyam                 76
2  Ghanshyam                 69
3      aditi                 97
4     Sachin                 88
5     mayank                 65
6        raj                 77
7      rahul                 83

In [16]:
# Handling Missing Data
import pandas as pd

data = {
    "Name": ['Ram',None, 'Ghanshyam', 'aditi', 'Sachin', 'mayank', 'raj', 'rahul'],
    "age": [20, 30, None, 50, 29, 12, 44, 32],
    "salary": [50000, 40000, 30000, 60000, None, 44000, 56000, 70000],
    "performance_score": [None, 76, 69, 97, 88, 65, 77, 83]
}
df = pd.DataFrame(data)
print(df)
print(df.isnull().sum())
print(df.dropna(axis=0,inplace=True))
print(df)

        Name   age   salary  performance_score
0        Ram  20.0  50000.0                NaN
1       None  30.0  40000.0               76.0
2  Ghanshyam   NaN  30000.0               69.0
3      aditi  50.0  60000.0               97.0
4     Sachin  29.0      NaN               88.0
5     mayank  12.0  44000.0               65.0
6        raj  44.0  56000.0               77.0
7      rahul  32.0  70000.0               83.0
Name                 1
age                  1
salary               1
performance_score    1
dtype: int64
None
     Name   age   salary  performance_score
3   aditi  50.0  60000.0               97.0
5  mayank  12.0  44000.0               65.0
6     raj  44.0  56000.0               77.0
7   rahul  32.0  70000.0               83.0

In [39]:
import pandas as pd

data = {
    "Name": ['Ram',None, 'Ghanshyam', 'aditi', 'Sachin', 'mayank', 'raj', 'rahul'],
    "age": [20, 30, None, 50, 29, 12, 44, 32],
    "salary": [50000, 40000, 30000, 60000, None, 44000, 56000, 70000],
    "performance_score": [None, 76, 69, 97, 88, 65, 77, 83]
}
df = pd.DataFrame(data)
print(df)
print(df.isnull())
print(df.fillna(0,inplace=True))
print(df)

        Name   age   salary  performance_score
0        Ram  20.0  50000.0                NaN
1       None  30.0  40000.0               76.0
2  Ghanshyam   NaN  30000.0               69.0
3      aditi  50.0  60000.0               97.0
4     Sachin  29.0      NaN               88.0
5     mayank  12.0  44000.0               65.0
6        raj  44.0  56000.0               77.0
7      rahul  32.0  70000.0               83.0
    Name    age  salary  performance_score
0  False  False   False               True
1   True  False   False              False
2  False   True   False              False
3  False  False   False              False
4  False  False    True              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
None
        Name   age   salary  performance_score
0        Ram  20.0  50000.0                0.0
1          0  30.0  40000.0               76.0
2  Ghanshyam   0.0  30000.0               69.0
3      aditi  50.0  60000.0               97.0
4     Sachin  29.0      0.0               88.0
5     mayank  12.0  44000.0               65.0
6        raj  44.0  56000.0               77.0
7      rahul  32.0  70000.0               83.0

In [29]:
import pandas as pd

data = {
    "Name": ['Ram',None, 'Ghanshyam', 'aditi', 'Sachin', 'mayank', 'raj', 'rahul'],
    "age": [20, 30, None, 50, 29, 12, 44, 32],
    "salary": [50000, 40000, 30000, 60000, None, 44000, 56000, 70000],
    "performance_score": [None, 76, 69, 97, 88, 65, 77, 83]
}
df = pd.DataFrame(data)
print(df)
print(df['age'].fillna(df['age'].mean()))

        Name   age   salary  performance_score
0        Ram  20.0  50000.0                NaN
1       None  30.0  40000.0               76.0
2  Ghanshyam   NaN  30000.0               69.0
3      aditi  50.0  60000.0               97.0
4     Sachin  29.0      NaN               88.0
5     mayank  12.0  44000.0               65.0
6        raj  44.0  56000.0               77.0
7      rahul  32.0  70000.0               83.0
0    20.0
1    30.0
2    31.0
3    50.0
4    29.0
5    12.0
6    44.0
7    32.0
Name: age, dtype: float64

In [43]:
# interpolation
import numpy as np
data = {'salary': [50000, None, 60000, None, 70000]}
df = pd.DataFrame(data)
print(df)
df['salary'] = df['salary'].interpolate()
print(df)

    salary
0  50000.0
1      NaN
2  60000.0
3      NaN
4  70000.0
    salary
0  50000.0
1  55000.0
2  60000.0
3  65000.0
4  70000.0

In [4]:
import pandas as pd

data = {
    "Name": ['Ram', 'Shyam', 'Ghanshyam', 'aditi', 'Sachin', 'mayank', 'raj', 'rahul'],
    "age": [20, 30, 40, 50, 29, 12, 44, 32],
    "salary": [50000, 40000, 30000, 60000, 73000, 44000, 56000, 70000],
    "performance_score": [80, 76, 69, 97, 88, 65, 77, 83]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Sort by salary ascending, then by age ascending
df = df.sort_values(by=['salary','age'], ascending=[True, True])

print("\nSorted DataFrame:")
print(df)

Original DataFrame:
        Name  age  salary  performance_score
0        Ram   20   50000                 80
1      Shyam   30   40000                 76
2  Ghanshyam   40   30000                 69
3      aditi   50   60000                 97
4     Sachin   29   73000                 88
5     mayank   12   44000                 65
6        raj   44   56000                 77
7      rahul   32   70000                 83

Sorted DataFrame:
        Name  age  salary  performance_score
2  Ghanshyam   40   30000                 69
1      Shyam   30   40000                 76
5     mayank   12   44000                 65
0        Ram   20   50000                 80
6        raj   44   56000                 77
3      aditi   50   60000                 97
7      rahul   32   70000                 83
4     Sachin   29   73000                 88

In [11]:
# Aggregation
import pandas as pd

# Sample Data
data = {
    "Department": ['HR', 'Finance', 'IT', 'IT', 'Finance', 'HR', 'IT', 'Finance'],
    "Employee": ['Ram', 'Shyam', 'Ghanshyam', 'Aditi', 'Sachin', 'Mayank', 'Raj', 'Rahul'],
    "Age": [25, 30, 28, 35, 29, 32, 40, 31],
    "Salary": [50000, 60000, 55000, 70000, 65000, 52000, 72000, 68000],
    "Performance_Score": [80, 90, 85, 95, 88, 82, 96, 89]
}

# Create DataFrame
df = pd.DataFrame(data)
print(df)
print(df['Salary'].mean())
print(df['Salary'].sum())
print(df['Performance_Score'].min())
print(df['Age'].max())

  Department   Employee  Age  Salary  Performance_Score
0         HR        Ram   25   50000                 80
1    Finance      Shyam   30   60000                 90
2         IT  Ghanshyam   28   55000                 85
3         IT      Aditi   35   70000                 95
4    Finance     Sachin   29   65000                 88
5         HR     Mayank   32   52000                 82
6         IT        Raj   40   72000                 96
7    Finance      Rahul   31   68000                 89
61500.0
492000
80
40

In [19]:
# Grouping
import pandas as pd

# Sample Data
data = {
    "Department": ['HR', 'Finance', 'IT', 'IT', 'Finance', 'HR', 'IT', 'Finance'],
    "Employee": ['Ram', 'Shyam', 'Ghanshyam', 'Aditi', 'Sachin', 'Mayank', 'Raj', 'Rahul'],
    "Age": [25, 25, 28, 35, 29, 31, 40, 31],
    "Salary": [50000, 60000, 55000, 70000, 65000, 52000, 72000, 68000],
    "Performance_Score": [80, 90, 85, 95, 88, 82, 96, 89]
}
df=pd.DataFrame(data)
print(df)
grp=df.groupby("Age")['Salary'].sum()
print(grp)
#Multiple Aggregations
grouped=df.groupby(['Age','Employee'])["Salary"].sum()
print(grouped)

  Department   Employee  Age  Salary  Performance_Score
0         HR        Ram   25   50000                 80
1    Finance      Shyam   25   60000                 90
2         IT  Ghanshyam   28   55000                 85
3         IT      Aditi   35   70000                 95
4    Finance     Sachin   29   65000                 88
5         HR     Mayank   31   52000                 82
6         IT        Raj   40   72000                 96
7    Finance      Rahul   31   68000                 89
Age
25    110000
28     55000
29     65000
31    120000
35     70000
40     72000
Name: Salary, dtype: int64
Age  Employee
25   Ram          50000
     Shyam        60000
28   Ghanshyam    55000
29   Sachin       65000
31   Mayank       52000
     Rahul        68000
35   Aditi        70000
40   Raj          72000
Name: Salary, dtype: int64

In [1]:
# Merging and Joining
import pandas as pd
df_customers=pd.DataFrame({
    'CustomerID':[1,2,3],
    'Name':['Ram','Shyam','Ghanshyam']
})
df_order=pd.DataFrame({
    'CustomerID':[1,2,4],
    'OrderAmount':[250,450,350]
})
df_merged=pd.merge(df_customers,df_order,on='CustomerID',how='inner')
print("Inner Joining")
print(df_merged)
df_merged=pd.merge(df_customers,df_order,on='CustomerID',how='outer')
print("Outer Joining")
print(df_merged)
df_merged=pd.merge(df_customers,df_order,on='CustomerID',how='left')
print("Left Joining")
print(df_merged)
df_merged=pd.merge(df_customers,df_order,on='CustomerID',how='right')
print("Right Joining")
print(df_merged)

Inner Joining
   CustomerID   Name  OrderAmount
0           1    Ram          250
1           2  Shyam          450
Outer Joining
   CustomerID       Name  OrderAmount
0           1        Ram        250.0
1           2      Shyam        450.0
2           3  Ghanshyam          NaN
3           4        NaN        350.0
Left Joining
   CustomerID       Name  OrderAmount
0           1        Ram        250.0
1           2      Shyam        450.0
2           3  Ghanshyam          NaN
Right Joining
   CustomerID   Name  OrderAmount
0           1    Ram          250
1           2  Shyam          450
2           4    NaN          350

In [7]:
#Concatenation
import pandas as pd
df1 = pd.DataFrame({
    'CustomerID': [1, 2],
    'Name': ['Ram', 'Shyam']
})

df2 = pd.DataFrame({
    'CustomerID': [3, 4],
    'Name': ['Ghanshyam', 'Aditi']
})

result = pd.concat([df1, df2], ignore_index=True)
print(result)
result = pd.concat([df1, df2],axis=1, ignore_index=True)
print('Horizontal')
print(result)

   CustomerID       Name
0           1        Ram
1           2      Shyam
2           3  Ghanshyam
3           4      Aditi
Horizontal
   0      1  2          3
0  1    Ram  3  Ghanshyam
1  2  Shyam  4      Aditi

In [13]:
import pandas as pd
s=pd.Series([10,20,30,40,50])
print(s)
print(s.dtype)
print(s.values)
print(s.index)
print(s[0])
print(s[0:3])
# iloc (location based indexing)
print(s.iloc[[1,4,3]])
s.name == 'calories'
print(s)
index=["apple","banana","orange","grapes","kiwi"]
s.index=index
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64
int64
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
10
0    10
1    20
2    30
dtype: int64
1    20
4    50
3    40
dtype: int64
0    10
1    20
2    30
3    40
4    50
dtype: int64
apple     10
banana    20
orange    30
grapes    40
kiwi      50
dtype: int64